<?php
/* @var $this yii\web\View */

$this->title = Yii::t('user', 'Адмін');
$this->params['breadcrumbs'][] = ['label' => Yii::t('user', 'Кабінет користувача'), 'url' => ['../room']];
//$this->params['breadcrumbs'][] = ['label' => Yii::t('user', 'Менеджер'), 'url' => ['index']];
$this->params['breadcrumbs'][] = $this->title;
var_dump($var);
?>
<h1>Курс валют</h1>
<?= $this->render('_menu') ?>

<p>
    У кабінеті адміністратора сайту можливо визначити базові налаштування, зокрема викзначити які групи у поточному році мають практику, проконтролювати користувачів, виконати розсилку електронних листів та смс, переглянути статистичні дані та інформацію про  договори та інші документи, що супроводжують практику та розподіл студентів.
</p>
<dl>

    <dt>"<strong>Користувачі</strong>"</dt>
    <dd>У розділі представлений список облікових записів користувачів, що зареєстровані на сайті. </dd>
    <br>



</dl>
