<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'Про проект';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">
    <!--h1><?= Html::encode($this->title) ?></h1-->
    <h1>Що таке Інтернет речей і чому це важливо?</h1>

    <p>
        Інтернет речей (Internet of things - IoT) не є чимсь новим: високотехнологічні компанії та експерти обговорюють ідею вже протягом багатьох десятиліть, і перший підключений до Інтернету тостер був представлений на конференції ще в 1989 році. За своєю суттю, IoT простий: мова йде про підключення пристроїв через Інтернет, дозволяючи їм спілкуватися з нами, додатками і один з одним.
    </p>
    <p>
        Популярним прикладом, якщо незрозуміло, є смарт-холодильник: як відносно того, щоб ваш холодильник міг сказати, що немає молока, відправивши вам повідомлення, що в його промоніторених внутрішніх камерах не залишилося нічого, або що на коробці, яка лежить в ньому, вже підійшла дата використання?
    </p>
    <p>
        IoT, однак, ширший, ніж  розумні будинки і підключені пристрої. Він масштабується до інтелектуальних міст - підключаючи світлофори через відстеження трафіка, або смарт-контейнери, які сигналізують, коли вони повинні бути очищені - і промисловості, з підключених до всього датчиків, від відстеження посилок до моніторингу сільськогосподарських угідь.
    </p>
    <p>
        Чому це важливо? Всі ці дані і автоматизоване їх використання є більш ефективним, а це означає, що ми будемо споживати менше енергії.
    </p>
    <p>
        IoT важливий тому, що об'єкт, який може представити себе в цифровому вигляді, стає щось більшим, ніж об'єкт сам по собі. В той же час, Інтернет речей є складною концепцією, щоб визначити її точно. IoT описує світ, де все, що завгодно, може бути підключене і спілкуватися в інтелігентній манері. Іншими словами, з Інтернетом речей фізичний світ стає однією великою інформаційною системою.
    </p>
    <p>
        IoT все більш і більш стає темою розмови як на робочому місці, так і за його межами. Це концепція, яка має потенціал, щоб впливати не тільки на те, як ми живемо, а й на те, як ми працюємо. Але що саме є "Інтернет речей" і який вплив він матиме на нас, якщо такий є?
    </p>
    <p>
    <p>Давайте почнемо з розуміння кількох речей.</p>
    <p>Широкосмуговий Інтернет стає все більш широко доступним, вартість підключення знижується, все більше пристроїв створюються з можливостями Wi-Fi і датчиками, вбудованим в них, витрати на технології зменшуються, і розумний телефон стрімко проникає всюди. Всі ці речі створюють "ідеальний шторм" для IoT.</p>
    <p style="text-align: center"><img src="http://mikrotik.kpi.ua/images/Raspberry_Pi/IoT_1.jpg" /></p>
    <p>Аналітики фірми Gartner стверджують, що до 2020 року буде понад 26 млрд підключених пристроїв ... це багато з‘єднань (а дехто навіть вважає це число набагато більшим, понад 100 млрд). IoT є гігантською мережею пов'язаних "речей" (яка також включає людей).</p>

        <h2>Наскільки це безпечно? Чи може Інтернет речей бути безпечним?</h2>

    <p>Все нове і блискуче має недоліки, і безпека та конфіденційність - найбільші проблеми для IoT. Всі пристрої та системи збору тримають багато персональних даних про людей - розумний вимірювач знає, коли ви вдома і яка використовується електроніка, коли ви там - і це спільно з іншими пристроями та міститься в базах даних компаній.</p>
    <p>З мільярдами пристроїв, з'єднаних разом, люди повинні бути впевнені, що їхня інформація залишається в безпеці? Чи не зможе хтось зламати тостер і тим самим отримати доступ до всієї вашої мережі? IoT також відкриває ще більше загроз безпеці компаніям по всьому світу.</p>
    <p>Експерти з безпеки стверджують, що робиться не достатньо для зміцнення безпеки та конфіденційності в IoT на нинішніх ранніх стадіях і, щоб довести свою точку, зламали безліч засобів, від підключеної відеоняні до автоматизованого освітлення та інтелектуальних холодильників, а також таких загальноміських систем, як сигнали світлофора.</p>
    <p>Хакери не звертають, здебільшого, велику увагу на IoT: ймовірно, є не достатньо людей, що намагаються використати підключені прилади для нападу на них, але, як завжди, як тільки буде фінансова вигода від злому розумного будинку, будуть працювати в цьому напрямку і зловмисники.</p>
    <p>Є також питання про недоторканість приватного життя та спільного використання даних. Це гаряча тема сьогодні, але можна тільки уявити, скільки розмов і проблем буде загострено, коли заговоримо про багато мільярдів з'єднаних пристроїв. Інше питання в тому, що багато спеціалізованих компаній будуть стикатися з масивною кількістю даних, які всі ці пристрої збираються виробляти. Компанії повинні з'ясувати спосіб для зберігання, відстеження, аналізу та розібратися у величезних обсягах даних, які будуть створені.</p>
    <p>Тому коротка відповідь: так, IoT є відносно безпечним - ви навряд чи зіткнеться з серйозною втратою або пошкодження через смарт-датчики, принаймні, не більше, ніж через свій домашній комп'ютер. Тим не менше, немає ніякої гарантії і досі робиться не достатньо для забезпечення захисту IoT від злому.</p>

        <h2>Як це позначиться на нас?</h2>

    <p>Новим правилом майбутнього буде "все, що може бути під'єднане, буде під'єднане". Але чому ви хочете так багато підключених пристроїв на Землі, які спілкуються один з одним? Є багато прикладів того, як це може виглядати, і того, що може бути потенційною цінністю. Як відносно того, що ваш будильник розбудить вас о 6:00 ранку, а потім повідомить, коли ваша кава буде готова, щоб ви почали її пити? А носимий вами пристрій, який використовуєте на робочому місці, може сказати вам, коли і де ви були найбільш активні і продуктивні та поділиться цією інформацією з іншими пристроями, які ви використовували під час роботи?</p>
    <p>У більш широкому масштабі IoT може бути застосований до таких речей, як транспортні мережі "розумних міст", що допоможе нам зменшити кількість відходів і підвищити ефективність, наприклад, використання енергії; він допомагає нам зрозуміти і поліпшити, як ми працюємо і живемо. Погляньте на візуалізацію нижче, щоб побачити, як може виглядати щось подібне:</p>
    <img src="http://mikrotik.kpi.ua/images/Raspberry_Pi/IoT_2.png"/>
    <p>Реальність така, що IoT дозволяє практично нескінченні можливості і під'єднання до таких місць, про багато з яких ми навіть не можемо подумати сьогодні, щоб повністю зрозуміти вплив. Не важко зрозуміти, як і чому IoT є такою гарячою темою сьогодні, бо він, безумовно, відкриває двері до великого числа можливостей, але і для багатьох проблем.</p>

        <h2>Як інтернет речей впливає на бізнес і працю?</h2>

    <p>Все залежить від вашої галузі: виробництво, мабуть, зайшло вперед далі в плані IoT, бо це корисно для організаційних інструментів, машин і людей, та відстеження, де вони знаходяться. Фермери також звертаються до підключених датчиків для моніторингу сільськогосподарських угідь і великої рогатої худоби, в надії на підвищення ефективності виробництва та відстеження стану здоров'я свого стада.</p>
    <p>Приклади нескінченні, і все, що ми можемо передбачити, що підключені пристрої, швидше за все, проникнуть в більшість підприємств, якщо вони мають комп'ютери і підключені до веб. Коли ефективність є інструментами або рослинами, то легко оцінити потенційну вигоду, але коли це офісні працівники, яких пресують для отримання додаткової продуктивності, ви можете трохи спохмурніти: уявіть собі картку безпеки для доступу, яка використовується для відстеження, де ви знаходитесь в будівлі, тому ваш бос може підрахувати, скільки часу ви витрачаєте на кухні, щоб зробити чай.</p>
    <p>З іншого боку, розумне відстеження чаю, коли відомо, коли ви його п‘єте, насправді може бути дуже зручним.</p>

        <h2>Що Інтернет речей означає для охорони здоров'я?</h2>

    <p>Розумні таблетки і підключені  пластирі для моніторингу вже доступні, підкреслюючи життєзберігаючий потенціал IoT, і багато людей вже оділи розумні годинники або фітнес-баслети на зап'ястя, щоб відслідковувати свої дії або серцебиття під час ходи.</p>
    <p>Здоров'я – це одна з областей, де багато даних надають потенціал, щоб врятувати життя запобіганням виникненню хвороби, моніторингу її і аналізуючи її, щоб створити нові методи лікування. Тим не менш, наше здоров'я також є однією з найбільш чутливих областей нашого життя, тому конфіденційності і безпеки знадобиться небагато більше, ніж профілактичні ліки.</p>

        <h2>Чи є Інтернет речей реальним?</h2>

        <p>Це, мабуть, кращий запит в пошуковій системі Google про майбутнє IoT: це реально?</p>
        <p>Дивно, що на це важко відповісти. Технологія сповнена маркетингу і реклами, тому часто важко вирішити на ранній стадії, чи є інновація дійсно новаторською чи ні. Адже багато експертів технологій знущалися з першого iPhone. Так змінювався цикл зрілості технологій Gartner за останні роки (порівняні 2012 і 2015 роки) :</p>
        <img src="http://mikrotik.kpi.ua/images/Raspberry_Pi/IoT_3.png"/>
        <p>На щастя, Інтернет речей є однією з тих широких ідей, які не залежать від одного проекту або продукту. Розумні холодильники також можуть бути приладами майбутнього, або можуть валятися на узбіччі, бо занадто багато технологій і занадто мало прибутку, але ідеї під'єднаних датчиків і інтелектуальних пристроїв, які приймають рішення без нашого втручання, будуть розвиватися.</p>
        <p>Через десять років все може бути підключене або, можливо, тільки одиниці і шматки з конкретними перевагами, такі як смарт-вимірювачі; і ми можемо назвати їх смарт-пристроями IoT, або не називати їх взагалі ніяк, подібно, як смартфони стануть просто телефонами.</p>
        <p>Незалежно від того, де він знаходиться і як ми його називаємо, IoT – реальний, але на те, як він буде виглядати в майбутньому, навіть Google сьогодні не може відповісти.</p>

    <p style="text-align: right"><a href="http://mikrotik.kpi.ua/index.php/courses-list/iot/79-what-is-the-internet-of-things-and-why-is-it-important">За матеріалами http://mikrotik.kpi.ua/</a></p>
<!--    <code>--><?//= __FILE__ ?><!--</code>-->
</div>
